// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   NshellStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell nshell command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_NSHELL_ENV_DRIVER          #language eng  "Shell environment driver not loaded or incorrect version\n"

#string STR_NSHELL_VERSION             #language eng  "%EEFI Shell version %01d.%02d [%d.%d]\n%NCurrent running mode %hs\n"

#string STR_NSHELL_CURDIR              #language eng  "%E%s> "

#string STR_NSHELL_ESHELL              #language eng  "%EShell> "

#string STR_NSHELL_SKIP_STARTUP        #language eng  "\rPress %HESC%N in %d seconds to skip %Estartup.nsh%N, any other key to continue. "



